

help_msg_en = 'Start Your Political Compass By Clicking The Button below 👇'
help_msg_ar = 'اضغط على الزر بالاسفل لتقييم نظامك السياسي 👇'
help_msg_ary = 'تكي على البطونة لي لتحت باش تقيم نظامك السياسي 👇'  

start_btn_en = 'Start 🧭'
start_btn_ar = 'ابدأ 🧭'
start_btn_ary = 'بدا 🧭'  

canceled_en = 'You Have Cancelled The Process'
canceled_ar = '🤷‍♂️ ?'
canceled_ary = 'Safi 3la khatrk'

starting_msg_en = 'Ladies and gentlemen, attack helicopters, welcome to a political orientation that will force you to abandon social constructs and find your true self! A journey in the right direction begins with the right compass'
starting_msg_ar = 'سيداتي وسادتي والطائرات الهجومية, مرحبا بكم في توجيه سياسي سيجبركم على ترك الهياكل الاجتماعية والعثور على النفس الحقيقية! يبدأ الرحلة في الاتجاه الصحيح ببوصلة صحيحة'

letsgo_btn_en = 'Let\'s Go 🚀'
letsgo_btn_ar = 'لنذهب 🚀'

ready_msg_en = 'Are You Ready?'
ready_msg_ar = 'هل انت جاهز؟'


chooselang_en = 'Choose your language'
chooselang_ar = 'اختر لغتك'
chooselang_ary = 'ختار اللغة'

langchanged_en = 'English '
langchanged_ar = 'العربية'
langchanged_ary = 'الداريجة'

wrnglanginput_en = 'Wrong Input'
wrnglanginput_ar = 'خطأ'

restart_btn_en = 'Restart 🔄'
restart_btn_ar = 'اعادة 🔄'

needhelp_msg_en = 'Use command /help'
needhelp_msg_ar = 'استخدم الامر /help'

# commands
helpcommand_en = 'Help!'
helpcommand_ar = 'مساعدة!'
helpcommand_ary = 'مساعدة!'

startcommand_en = 'Start your political compass test'
startcommand_ar = 'ابدأ اختبار نظامك السياسي'
startcommand_ary = 'ابدأ اختبار نظامك السياسي'

cancelcommand_en = 'Cancel the process'
cancelcommand_ar = 'الغاء العملية'
cancelcommand_ary = 'الغاء العملية'

langcommand_en = 'Change your language'
langcommand_ar = 'تغيير اللغة'
langcommand_ary = 'تغيير اللغة'

resultcommand_en = 'Get your result'
resultcommand_ar = 'احصل على نتيجتك'
resultcommand_ary = 'احصل على نتيجتك'



renamecommand_en = 'Rename your certificate'
renamecommand_ar = 'اعد تسمية شهادتك'
renamecommand_ary = 'اعد تسمية شهادتك'

helping_msg_en = 'This bot is a political compass test, it will help you find your political orientation. It is a simple test that will ask you a few questions and then give you a result. The result is not 100% accurate, but it will give you a general idea of your political orientation. The test is based on the political compass test, which you can find here: https://www.politicalcompass.org/test'
helping_msg_ar = 'هذا البوت هو اختبار البوصلة السياسية, سيساعدك على ايجاد توجيهك السياسي. انه اختبار بسيط سيسألك عن بعض الاسئلة ثم يعطيك نتيجة. النتيجة ليست دقيقة 100٪, لكنها ستعطيك فكرة عامة عن توجيهك السياسي. الاختبار يعتمد على اختبار البوصلة السياسية, الذي يمكنك العثور عليه هنا: https://www.politicalcompass.org/test'

journeycancel_msg_en = 'Cancel Your Journey By Using Command /cancel'
journeycancel_msg_ar = 'الغي رحلتك باستخدام الامر /cancel'


wronginput_en = 'Please, choose one of the options below 👇'
wronginput_ar = 'الرجاء اختيار احد الخيارات بالاسفل 👇'

question_en = 'Question'
question_ar = 'السؤال'

part1_msg_en = 'Part 1:  How you see the country and the world'
part1_msg_ar = 'الجزء 1: كيف ترى البلد والعالم'

part2_msg_en = 'Part 2: How you see the economy'
part2_msg_ar = 'الجزء 2: كيف ترى الاقتصاد'
# Now a look at some of your personal social values
part3_msg_en = 'Part 3: Some of your personal social values'
part3_msg_ar = 'الجزء 3: بعض قيمك الاجتماعية الشخصية'
# … and how you see the wider society.
part4_msg_en = 'Part 4: How you see the wider society'
part4_msg_ar = 'الجزء 4: كيف ترى المجتمع العام'
# If you got through that okay, you'll find these propositions on religion a breeze
part5_msg_en = 'Part 5: How you see the religion'
part5_msg_ar = 'الجزء 5: كيف ترى الدين'
# Finally, a look at sex
part6_msg_en = 'Part 6 Last one: A look at sex'
part6_msg_ar = 'الجزء 6 الأخير: لمحة عن الجنس'

lastq_msg_en = 'Last Question'
lastq_msg_ar = 'السؤال الأخير'

wait_msg_en = 'Wait Please ⏳'
wait_msg_ar = 'انتظر من فضلك ⏳'

s_disagree_en = 'Strongly Disagree'
s_disagree_ar = 'معارض بشدة'

disagree_en = 'Disagree'
disagree_ar = 'معارض'

s_agree_en = 'Strongly Agree'
s_agree_ar = 'مؤيد بشدة'

agree_en = 'Agree'
agree_ar = 'مؤيد'

elr_msg_en = 'Economic Left/Right'
elr_msg_ar = 'اليسار/اليمين الاقتصادي'

sla_msg_en = 'Social Libertarian/Authoritarian'
sla_msg_ar = 'الحرية الاجتماعية/التطبيع'

urpc_msg_en = 'Your Political Compass Results'
urpc_msg_ar = 'نتائجك'

chart_msg_en = 'Take a look at your chart'
chart_msg_ar = 'انظر الى الرسم البياني الخاص بك'

pdf_msg_en = 'Here is your certificate'
pdf_msg_ar = 'هاهي شهادتك'

link_msg_en = 'Here is your link'
link_msg_ar = 'هاهو رابطك'

tnks_msg_en = 'Thank you for using our bot! \n\nIf you want to restart, press the button below 👇'
tnks_msg_ar = 'شكرا لاستخدامكم البوت! \n\nاذا اردت اعادة البدء, اضغط على الزر بالاسفل 👇'

rename_msg_en = 'To rename your certificate, send me a new name'
rename_msg_ar = 'لتغيير اسم شهادتك, ارسل لي اسم جديد'

noresults_msg_en = 'You have not taken the test yet'
noresults_msg_ar = 'لم تقم بعمل الاختبار بعد'


def_questions_ar = {
    1: "إذا كانت العولمة الاقتصادية حتمية , فيجب أن تخدم الإنسانية في المقام الأول وليس مصالح الشركات عبر الوطنية." ,
    2: "كنت سأدعم بلادي دائما , سواء كانت على صواب أو خطأ." ,
    3: "لا أحد يختار بلد ميلاده , لذلك من الحماقة أن تفتخر به." ,
    4: "لدينا العديد من الصفات المتفوقة مقارنة مع الأجناس الأخرى." ,
    5: "عدو عدوي صديقي" ,
    6: "العمل العسكري الذي يتعارض مع القانون الدولي يكون له ما يبرره في بعض الأحيان" ,
    7: "هناك الآن انصهار مقلق للمعلومات والترفيه." ,
    8: "الناس في نهاية المطاف منقسمون حسب الطبقة أكثر من حسب الجنسية." ,
    9: "السيطرة على التضخم أهم من السيطرة على البطالة",
    10: "لأن الشركات لا يمكن الوثوق بها لحماية البيئة طواعية , فهي تتطلب تنظيمًا." ,
    11: " \"من كل حسب قدرته , لكل حسب حاجته\" هي فكرة جيدة في الأساس . ",
    12: "إنه انعكاس محزن لمجتمعنا أن شيئًا أساسيًا مثل مياه الشرب أصبح الآن منتجًا استهلاكيًا معبأًا بعلامة تجارية." ,
    13: "لا ينبغي أن تكون الأرض سلعة تباع وتشترى",
    14: "من المؤسف أن الكثير من الثروات الشخصية يصنعها أناس يتلاعبون بالمال ببساطة ولا يساهمون بشيء في مجتمعهم",
    15: "الحمائية ضرورية في بعض الأحيان في التجارة." ,
    16: "المسؤولية الاجتماعية الوحيدة للشركة يجب أن تكون تحقيق ربح لمساهميها." ,
    17: "الأغنياء يخضعون لضرائب عالية" ,
    18: "أولئك الذين لديهم القدرة على الدفع يجب أن يكون لهم الحق في مستويات أعلى من الرعاية الطبية." ,
    19: "يجب على الحكومات معاقبة الأعمال التجارية التي تضلل الجمهور",
    20: "تتطلب السوق الحرة الحقيقية قيودًا على قدرة الشركات متعددة الجنسيات المفترسة على إنشاء احتكارات." ,
    21: "كلما كان السوق أكثر حرية , كلما كان الناس أكثر حرية" ,
    22: "الإجهاض , عندما لا تكون حياة المرأة مهددة , يجب أن يكون دائمًا غير قانوني" ,
    23: "يجب استجواب كل سلطة.",
    24: "العين بالعين والسن بالسن",
    25: "لا ينبغي أن يُتوقع من دافعي الضرائب دعم أي مسارح أو متاحف لا يمكن أن تعيش على أساس تجاري." ,
    26: "يجب على المدارس ألا تجعل الحضور في الفصول الدراسية إلزاميًا" ,
    27: "كل الناس لهم حقوقهم , لكن الأفضل لنا جميعًا أن أنواعًا مختلفة من الناس يجب أن تحافظ على نوعها الخاص." ,
    28: "الآباء الطيبون يضطرون أحيانًا إلى صفع أطفالهم" ,
    29: "من الطبيعي أن يحتفظ الأطفال ببعض الأسرار عن والديهم",
    30: "لا ينبغي أن يكون حيازة الماريجوانا للاستخدام الشخصي جريمة جنائية.",
    31: "يجب أن تكون الوظيفة الأساسية للتعليم هي تجهيز جيل المستقبل لإيجاد وظائف." ,
    32: "لا ينبغي السماح للأشخاص الذين يعانون من إعاقات وراثية خطيرة بالتكاثر." ,
    33: "أهم شيء يتعلمه الأطفال هو قبول التأديب",
    34: "لا توجد شعوب متوحشة ومتحضرة , هناك فقط ثقافات مختلفة",
    35: "أولئك القادرون على العمل , والذين يرفضون الفرصة , يجب ألا يتوقعوا دعم المجتمع" ,
    36: "عندما تكون مضطربًا , من الأفضل ألا تفكر في الأمر , ولكن أن تنشغل بأشياء أكثر بهجة." ,
    37: "الجيل الأول من المهاجرين لا يمكن أبدًا الاندماج الكامل في بلدهم الجديد." ,
    38: "ما هو جيد للشركات الأكثر نجاحًا هو دائمًا , في النهاية , جيد لنا جميعًا." ,
    39: "لا ينبغي لأي مؤسسة إذاعية , مهما كانت مستقلة , أن تتلقى تمويلًا عامًا",
    40: "يتم تقييد حرياتنا المدنية بشكل مفرط باسم مكافحة الإرهاب",
    41: "الميزة المهمة لدولة الحزب الواحد هي أنها تتجنب كل الحجج التي تؤخر التقدم في نظام سياسي ديمقراطي." ,
    42: "على الرغم من أن العصر الإلكتروني يجعل المراقبة الرسمية أسهل , إلا أن المخالفين فقط هم من يحتاجون إلى القلق",
    43: "يجب أن تكون عقوبة الإعدام خيارًا لأخطر الجرائم",
    44: "في مجتمع متحضر , يجب أن يكون لدى المرء دائمًا أشخاص فوقهم ليتم طاعتهم ويؤمر الناس أدناه." ,
    45: "الفن التجريدي الذي لا يمثل أي شيء لا ينبغي اعتباره فنًا على الإطلاق." ,
    46: "في العدالة الجنائية , يجب أن تكون العقوبة أكثر أهمية من إعادة التأهيل" ,
    47: "مضيعة للوقت في محاولة إعادة تأهيل بعض المجرمين" ,
    48: "رجل الأعمال والصانع أهم من الكاتب والفنان",
    49: "قد يكون للأم مهنة , لكن واجبهن الأول هو أن تكون ربات منزل." ,
    50: "الشركات متعددة الجنسيات تستغل بشكل غير أخلاقي الموارد الوراثية النباتية للبلدان النامية.",
    51: "صنع السلام مع المؤسسة هو جانب مهم من جوانب النضج" ,
    52: "علم التنجيم يشرح أشياء كثيرة بدقة." ,
    53: "لا يمكنك أن تكون أخلاقيًا دون أن تكون متدينًا",
    54: "الصدقة خير من الضمان الاجتماعي كوسيلة لمساعدة المحرومين حقًا." ,
    55: "بعض الناس غير محظوظين بشكل طبيعي." ,
    56: "من المهم أن تغرس مدرسة طفلي القيم الدينية." ,
    57: "الجنس خارج الزواج عادة ما يكون غير أخلاقي" ,
    58: "لا ينبغي استبعاد الزوجين من نفس الجنس في علاقة مستقرة ومحبة , من إمكانية تبني الأطفال." ,
    59: "يجب أن تكون المواد الإباحية , التي تصور البالغين بالتراضي , قانونية للبالغين." ,
    60: "ما يحدث في غرفة النوم الخاصة بين البالغين ليس من اختصاص الدولة." ,
    61: "لا أحد يستطيع أن يشعر بالشذوذ الجنسي بشكل طبيعي" ,
    62: "الانفتاح على الجنس في هذه الأيام قد ذهب بعيدا جدا",
}


def_questions_en = {
    1:	"If economic globalisation is inevitable, it should primarily serve humanity rather than the interests of trans-national corporations.",
    2:	"I'd always support my country, whether it was right or wrong.",
    3:	"No one chooses his or her country of birth, so it's foolish to be proud of it.",
    4:	"Our race has many superior qualities, compared with other races.",
    5:	"The enemy of my enemy is my friend.",
    6:	"Military action that defies international law is sometimes justified.",
    7:	"There is now a worrying fusion of information and entertainment.",
    8:	"People are ultimately divided more by class than by nationality.",
    9:	"Controlling inflation is more important than controlling unemployment.",
    10:	"Because corporations cannot be trusted to voluntarily protect the environment, they require regulation.",
    11:	"\"from each according to his ability, to each according to his need\" is a fundamentally good idea.",
    12:	"It's a sad reflection on our society that something as basic as drinking water is now a bottled, branded consumer product.",
    13:	"Land shouldn't be a commodity to be bought and sold.",
    14:	"It is regrettable that many personal fortunes are made by people who simply manipulate money and contribute nothing to their society.",
    15:	"Protectionism is sometimes necessary in trade.",
    16:	"The only social responsibility of a company should be to deliver a profit to its shareholders.",
    17:	"The rich are too highly taxed.",
    18:	"Those with the ability to pay should have the right to higher standards of medical care .",
    19:	"Governments should penalise businesses that mislead the public.",
    20:	"A genuine free market requires restrictions on the ability of predator multinationals to create monopolies.",
    21:	"The freer the market, the freer the people.",
    22:	"Abortion, when the woman's life is not threatened, should always be illegal.",
    23:	"All authority should be questioned.",
    24:	"An eye for an eye and a tooth for a tooth.",
    25:	"Taxpayers should not be expected to prop up any theatres or museums that cannot survive on a commercial basis.",
    26:	"Schools should not make classroom attendance compulsory.",
    27:	"All people have their rights, but it is better for all of us that different sorts of people should keep to their own kind.",
    28:	"Good parents sometimes have to spank their children.",
    29:	"It's natural for children to keep some secrets from their parents.",
    30:	"Possessing marijuana for personal use should not be a criminal offence.",
    31:	"The prime function of schooling should be to equip the future generation to find jobs.",
    32:	"People with serious inheritable disabilities should not be allowed to reproduce.",
    33:	"The most important thing for children to learn is to accept discipline.",
    34:	"There are no savage and civilised peoples; there are only different cultures.",
    35:	"Those who are able to work, and refuse the opportunity, should not expect society's support.",
    36:	"When you are troubled, it's better not to think about it, but to keep busy with more cheerful things.",
    37:	"First-generation immigrants can never be fully integrated within their new country.",
    38:	"What's good for the most successful corporations is always, ultimately, good for all of us.",
    39:	"No broadcasting institution, however independent its content, should receive public funding.",
    40:	"Our civil liberties are being excessively curbed in the name of counter-terrorism.",
    41:	"A significant advantage of a one-party state is that it avoids all the arguments that delay progress in a democratic political system.",
    42:	"Although the electronic age makes official surveillance easier, only wrongdoers need to be worried.",
    43:	"The death penalty should be an option for the most serious crimes.",
    44:	"In a civilised society, one must always have people above to be obeyed and people below to be commanded.",
    45:	"Abstract art that doesn't represent anything shouldn't be considered art at all.",
    46:	"In criminal justice, punishment should be more important than rehabilitation.",
    47:	"It is a waste of time to try to rehabilitate some criminals.",
    48:	"The businessperson and the manufacturer are more important than the writer and the artist.",
    49:	"Mothers may have careers, but their first duty is to be homemakers.",
    50:	"Multinational companies are unethically exploiting the plant genetic resources of developing countries.",
    51:	"Making peace with the establishment is an important aspect of maturity.",
    52:	"Astrology accurately explains many things.",
    53:	"You cannot be moral without being religious.",
    54:	"Charity is better than social security as a means of helping the genuinely disadvantaged.",
    55:	"Some people are naturally unlucky.",
    56:	"It is important that my child's school instills religious values.",
    57:	"Sex outside marriage is usually immoral.",
    58:	"A same sex couple in a stable, loving relationship, should not be excluded from the possibility of child adoption.",
    59:	"Pornography, depicting consenting adults, should be legal for the adult population.",
    60:	"What goes on in a private bedroom between consenting adults is no business of the state.",
    61:	"No one can feel naturally homosexual.",
    62:	"These days openness about sex has gone too far."
}

def_questions_ary = {
    1: "إذا كانت العولمة الاقتصادية حتمية , فيجب أن تخدم الإنسانية في المقام الأول وليس مصالح الشركات عبر الوطنية." ,
    2: "كنت سأدعم بلادي دائما , سواء كانت على صواب أو خطأ." ,
    3: "لا أحد يختار بلد ميلاده , لذلك من الحماقة أن تفتخر به." ,
    4: "لدينا العديد من الصفات المتفوقة مقارنة مع الأجناس الأخرى." ,
    5: "عدو عدوي صديقي" ,
    6: "العمل العسكري الذي يتعارض مع القانون الدولي يكون له ما يبرره في بعض الأحيان" ,
    7: "هناك الآن انصهار مقلق للمعلومات والترفيه." ,
    8: "الناس في نهاية المطاف منقسمون حسب الطبقة أكثر من حسب الجنسية." ,
    9: "السيطرة على التضخم أهم من السيطرة على البطالة",
    10: "لأن الشركات لا يمكن الوثوق بها لحماية البيئة طواعية , فهي تتطلب تنظيمًا." ,
    11: " \"من كل حسب قدرته , لكل حسب حاجته\" هي فكرة جيدة في الأساس . ",
    12: "إنه انعكاس محزن لمجتمعنا أن شيئًا أساسيًا مثل مياه الشرب أصبح الآن منتجًا استهلاكيًا معبأًا بعلامة تجارية." ,
    13: "لا ينبغي أن تكون الأرض سلعة تباع وتشترى",
    14: "من المؤسف أن الكثير من الثروات الشخصية يصنعها أناس يتلاعبون بالمال ببساطة ولا يساهمون بشيء في مجتمعهم",
    15: "الحمائية ضرورية في بعض الأحيان في التجارة." ,
    16: "المسؤولية الاجتماعية الوحيدة للشركة يجب أن تكون تحقيق ربح لمساهميها." ,
    17: "الأغنياء يخضعون لضرائب عالية" ,
    18: "أولئك الذين لديهم القدرة على الدفع يجب أن يكون لهم الحق في مستويات أعلى من الرعاية الطبية." ,
    19: "يجب على الحكومات معاقبة الأعمال التجارية التي تضلل الجمهور",
    20: "تتطلب السوق الحرة الحقيقية قيودًا على قدرة الشركات متعددة الجنسيات المفترسة على إنشاء احتكارات." ,
    21: "كلما كان السوق أكثر حرية , كلما كان الناس أكثر حرية" ,
    22: "الإجهاض , عندما لا تكون حياة المرأة مهددة , يجب أن يكون دائمًا غير قانوني" ,
    23: "يجب استجواب كل سلطة.",
    24: "العين بالعين والسن بالسن",
    25: "لا ينبغي أن يُتوقع من دافعي الضرائب دعم أي مسارح أو متاحف لا يمكن أن تعيش على أساس تجاري." ,
    26: "يجب على المدارس ألا تجعل الحضور في الفصول الدراسية إلزاميًا" ,
    27: "كل الناس لهم حقوقهم , لكن الأفضل لنا جميعًا أن أنواعًا مختلفة من الناس يجب أن تحافظ على نوعها الخاص." ,
    28: "الآباء الطيبون يضطرون أحيانًا إلى صفع أطفالهم" ,
    29: "من الطبيعي أن يحتفظ الأطفال ببعض الأسرار عن والديهم",
    30: "لا ينبغي أن يكون حيازة الماريجوانا للاستخدام الشخصي جريمة جنائية.",
    31: "يجب أن تكون الوظيفة الأساسية للتعليم هي تجهيز جيل المستقبل لإيجاد وظائف." ,
    32: "لا ينبغي السماح للأشخاص الذين يعانون من إعاقات وراثية خطيرة بالتكاثر." ,
    33: "أهم شيء يتعلمه الأطفال هو قبول التأديب",
    34: "لا توجد شعوب متوحشة ومتحضرة , هناك فقط ثقافات مختلفة",
    35: "أولئك القادرون على العمل , والذين يرفضون الفرصة , يجب ألا يتوقعوا دعم المجتمع" ,
    36: "عندما تكون مضطربًا , من الأفضل ألا تفكر في الأمر , ولكن أن تنشغل بأشياء أكثر بهجة." ,
    37: "الجيل الأول من المهاجرين لا يمكن أبدًا الاندماج الكامل في بلدهم الجديد." ,
    38: "ما هو جيد للشركات الأكثر نجاحًا هو دائمًا , في النهاية , جيد لنا جميعًا." ,
    39: "لا ينبغي لأي مؤسسة إذاعية , مهما كانت مستقلة , أن تتلقى تمويلًا عامًا",
    40: "يتم تقييد حرياتنا المدنية بشكل مفرط باسم مكافحة الإرهاب",
    41: "الميزة المهمة لدولة الحزب الواحد هي أنها تتجنب كل الحجج التي تؤخر التقدم في نظام سياسي ديمقراطي." ,
    42: "على الرغم من أن العصر الإلكتروني يجعل المراقبة الرسمية أسهل , إلا أن المخالفين فقط هم من يحتاجون إلى القلق",
    43: "يجب أن تكون عقوبة الإعدام خيارًا لأخطر الجرائم",
    44: "في مجتمع متحضر , يجب أن يكون لدى المرء دائمًا أشخاص فوقهم ليتم طاعتهم ويؤمر الناس أدناه." ,
    45: "الفن التجريدي الذي لا يمثل أي شيء لا ينبغي اعتباره فنًا على الإطلاق." ,
    46: "في العدالة الجنائية , يجب أن تكون العقوبة أكثر أهمية من إعادة التأهيل" ,
    47: "مضيعة للوقت في محاولة إعادة تأهيل بعض المجرمين" ,
    48: "رجل الأعمال والصانع أهم من الكاتب والفنان",
    49: "قد يكون للأم مهنة , لكن واجبهن الأول هو أن تكون ربات منزل." ,
    50: "الشركات متعددة الجنسيات تستغل بشكل غير أخلاقي الموارد الوراثية النباتية للبلدان النامية.",
    51: "صنع السلام مع المؤسسة هو جانب مهم من جوانب النضج" ,
    52: "علم التنجيم يشرح أشياء كثيرة بدقة." ,
    53: "لا يمكنك أن تكون أخلاقيًا دون أن تكون متدينًا",
    54: "الصدقة خير من الضمان الاجتماعي كوسيلة لمساعدة المحرومين حقًا." ,
    55: "بعض الناس غير محظوظين بشكل طبيعي." ,
    56: "من المهم أن تغرس مدرسة طفلي القيم الدينية." ,
    57: "الجنس خارج الزواج عادة ما يكون غير أخلاقي" ,
    58: "لا ينبغي استبعاد الزوجين من نفس الجنس في علاقة مستقرة ومحبة , من إمكانية تبني الأطفال." ,
    59: "يجب أن تكون المواد الإباحية , التي تصور البالغين بالتراضي , قانونية للبالغين." ,
    60: "ما يحدث في غرفة النوم الخاصة بين البالغين ليس من اختصاص الدولة." ,
    61: "لا أحد يستطيع أن يشعر بالشذوذ الجنسي بشكل طبيعي" ,
    62: "الانفتاح على الجنس في هذه الأيام قد ذهب بعيدا جدا",
}

